# Team Pandas Series

In [187]:
# imports

import pandas as pd
import numpy as np

---

### Kombat 1: How to create a series from a list, numpy array and dict?

Create a pandas series from each of the items below: a list, numpy and a dictionary

In [188]:
# Input

mylist = list('abcde')
myarr = np.arange(5)
mydict = dict(zip(mylist, myarr))

In [189]:
# Fight!!!

mylistserie = pd.Series(mylist)
myarrserie = pd.Series(myarr)
mydictserie = pd.Series(mydict)

In [190]:
# Output

print(mylistserie)
print(myarrserie)
print(mydictserie)

0    a
1    b
2    c
3    d
4    e
dtype: object
0    0
1    1
2    2
3    3
4    4
dtype: int64
a    0
b    1
c    2
d    3
e    4
dtype: int64

---

### Kombat 2: How to get the items of series A not present in series B?

From ser1 remove items present in ser2.

In [191]:
# Input

ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [192]:
# Fight

result = ser1[~ser1.isin(ser2)]
result

0    1
1    2
2    3
dtype: int64

In [193]:
# Output

ser1

0    1
1    2
2    3
3    4
4    5
dtype: int64

---

### Kombat 3: How to bin a numeric series to 10 groups of equal size?

Bin the series ser into 10 equal deciles and replace the values with the bin name.

In [194]:
# Input

ser = pd.Series(np.random.random(20))

In [195]:
# Fight

bins = pd.qcut(ser, q=10, labels=False)
deciles = [f'Decile {i+1}' for i in range(10)]
result = pd.Series(deciles)[bins]

In [196]:
# Output

print(result)

7     Decile 8
8     Decile 9
6     Decile 7
9    Decile 10
0     Decile 1
2     Decile 3
7     Decile 8
4     Decile 5
3     Decile 4
4     Decile 5
3     Decile 4
1     Decile 2
9    Decile 10
8     Decile 9
2     Decile 3
6     Decile 7
0     Decile 1
5     Decile 6
5     Decile 6
1     Decile 2
dtype: object

---

### Kombat 4: How to convert a numpy array to a dataframe of given shape?

Reshape the series ser into a dataframe with 7 rows and 5 columns.

In [197]:
# Input

ser = pd.Series(np.random.randint(1, 10, 35))

In [198]:
# Fight

df = pd.DataFrame(np.array(ser).reshape(7, 5))

In [199]:
# Output

df

   0  1  2  3  4
0  2  7  2  8  5
1  1  6  9  5  2
2  9  5  5  6  8
3  6  9  3  3  7
4  8  1  3  3  4
5  7  3  7  3  8
6  5  3  4  3  2

---

### Kombat 5: How to create a TimeSeries starting ‘2022-01-02’ and 10 weekends (sundays) after that, having random numbers as values?

In [200]:
# Input

time_series = pd.Series(np.random.randint(1, 10, 10))

In [201]:
# Fight
start_date = '2022-01-02'

indices = pd.date_range(start=start_date, periods=10, freq='W-SUN')

time_series = pd.Series(np.random.randint(1, 10, 10), index=indices)

In [202]:
# Output

time_series

2022-01-02    3
2022-01-09    2
2022-01-16    3
2022-01-23    1
2022-01-30    8
2022-02-06    6
2022-02-13    7
2022-02-20    8
2022-02-27    4
2022-03-06    3
Freq: W-SUN, dtype: int64

---

### Kombat 6: How to change column values when importing csv to a dataframe?

Import the boston housing dataset, but while importing change the 'medv' (median house value) column so that values < 25 becomes ‘Low’ and > 25 becomes ‘High’.

In [203]:
# Input

url = 'https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv'

In [204]:
# Fight

df = pd.read_csv(url, converters = {'medv':lambda x: 'Low' if float(x) < 25 else 'High'})

In [205]:
# Solution

df

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,Low
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,Low
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,High
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,High
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,High
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273,21.0,391.99,9.67,Low
502,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273,21.0,396.90,9.08,Low
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273,21.0,396.90,5.64,Low
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273,21.0,393.45,6.48,Low
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273,21.0,396.90,7.88,Low

---

### Kombat 7: How to get the nrows, ncolumns, datatype, summary stats of each column of a dataframe?

Get the number of rows, columns, datatype and summary statistics of each column of the Cars93 dataset.

In [206]:
# Input

url = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'

In [207]:
#Fight

df = pd.read_csv(url)

nrows, ncols = df.shape

In [208]:
# Output
print(f"Number of rows: {nrows}")
print(f"Number of columns: {ncols}\n")

print("Data types:")
print(df.dtypes)
print('')

print("Data statistics of each column:")
df.describe()

Number of rows: 93
Number of columns: 27

Data types:
Manufacturer           object
Model                  object
Type                   object
Min.Price             float64
Price                 float64
Max.Price             float64
MPG.city              float64
MPG.highway           float64
AirBags                object
DriveTrain             object
Cylinders              object
EngineSize            float64
Horsepower            float64
RPM                   float64
Rev.per.mile          float64
Man.trans.avail        object
Fuel.tank.capacity    float64
Passengers            float64
Length                float64
Wheelbase             float64
Width                 float64
Turn.circle           float64
Rear.seat.room        float64
Luggage.room          float64
Weight                float64
Origin                 object
Make                   object
dtype: object

Data statistics of each column:

,Min.Price,Price,Max.Price,MPG.city,MPG.highway,EngineSize,Horsepower,RPM,Rev.per.mile,Fuel.tank.capacity,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight
count,86.000000,91.000000,88.000000,84.000000,91.000000,91.000000,86.000000,90.000000,87.000000,85.000000,91.000000,89.000000,92.000000,87.000000,88.000000,89.000000,74.000000,86.000000
mean,17.118605,19.616484,21.459091,22.404762,29.065934,2.658242,144.000000,5276.666667,2355.000000,16.683529,5.076923,182.865169,103.956522,69.448276,38.954545,27.853933,13.986486,3104.593023
std,8.828290,9.724280,10.696563,5.841520,5.370293,1.045845,53.455204,605.554811,486.916616,3.375748,1.045953,14.792651,6.856317,3.778023,3.304157,3.018129,3.120824,600.129993
min,6.700000,7.400000,7.900000,15.000000,20.000000,1.000000,55.000000,3800.000000,1320.000000,9.200000,2.000000,141.000000,90.000000,60.000000,32.000000,19.000000,6.000000,1695.000000
25%,10.825000,12.350000,14.575000,18.000000,26.000000,1.800000,100.750000,4800.000000,2017.500000,14.500000,4.000000,174.000000,98.000000,67.000000,36.000000,26.000000,12.000000,2647.500000
50%,14.600000,17.700000,19.150000,21.000000,28.000000,2.300000,140.000000,5200.000000,2360.000000,16.500000,5.000000,181.000000,103.000000,69.000000,39.000000,27.500000,14.000000,3085.000000
75%,20.250000,23.500000,24.825000,25.000000,31.000000,3.250000,170.000000,5787.500000,2565.000000,19.000000,6.000000,192.000000,110.000000,72.000000,42.000000,30.000000,16.000000,3567.500000
max,45.400000,61.900000,80.000000,46.000000,50.000000,5.700000,300.000000,6500.000000,3755.000000,27.000000,8.000000,219.000000,119.000000,78.000000,45.000000,36.000000,22.000000,4105.000000

---

### Kombat 8: How to slice a DataFrame by column value?

Get every Chevrolet car with a EngineSize lower than 3.0 from the Cars93 dataset.

In [209]:
# Input

url = 'https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv'

In [210]:
# Fight

df = pd.read_csv(url)
chevrolet_cars = df[(df['Manufacturer'] == 'Chevrolet') & (df['EngineSize'] < 3)]

In [211]:
# Output

chevrolet_cars

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
11,Chevrolet,Cavalier,Compact,8.5,13.4,18.3,25.0,36.0,NaN,NaN,...,5.0,182.0,101.0,66.0,38.0,25.0,13.0,2490.0,USA,Chevrolet Cavalier
12,Chevrolet,Corsica,Compact,11.4,11.4,11.4,25.0,34.0,Driver only,Front,...,5.0,184.0,103.0,68.0,39.0,26.0,NaN,2785.0,USA,Chevrolet Corsica
14,Chevrolet,Lumina,Midsize,13.4,15.9,18.4,NaN,29.0,NaN,Front,...,6.0,NaN,108.0,71.0,NaN,28.5,16.0,3195.0,USA,Chevrolet Lumina

---

# FINISH HIM!!!